Ran Plan for project: `sharedservices-prod` dir: `accounts/sharedservices-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_gateway_response.default_4xx_cors will be updated in-place
~ resource "aws_api_gateway_gateway_response" "default_4xx_cors" {
        id                  = "aggr-70paytfqfb-DEFAULT_4XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # aws_api_gateway_gateway_response.default_5xx_cors will be updated in-place
~ resource "aws_api_gateway_gateway_response" "default_5xx_cors" {
        id                  = "aggr-70paytfqfb-DEFAULT_5XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # aws_api_gateway_stage.api_stage will be updated in-place
~ resource "aws_api_gateway_stage" "api_stage" {
      ~ deployment_id         = "ngjs04" -> "auxvbl"
        id                    = "ags-70paytfqfb-prod"
        tags                  = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_task_definition.weekly_news_recap must be replaced
-/+ resource "aws_ecs_task_definition" "weekly_news_recap" {
      ~ arn                      = "arn:aws:ecs:us-east-2:825765422855:task-definition/weekly_news_recap:5" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:825765422855:task-definition/weekly_news_recap" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - essential        = true
                  ~ image            = "825765422855.dkr.ecr.us-east-2.amazonaws.com/weekly_news_recap_repository@sha256:b5c80c453679faecdffa947c527cf72c5c9cbc03c1071773c7938b63f5f91d38" -> "825765422855.dkr.ecr.us-east-2.amazonaws.com/weekly_news_recap_repository@sha256:618d32bfaa6ca20b95147253ce73cbb6643e7985370476c442445ffee2ca420c"
                    name             = "weekly_recap"
                  - portMappings     = []
                  - systemControls   = []
                  - volumesFrom      = []
                    # (4 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "weekly_news_recap" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
      - tags                     = {} -> null
        # (13 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "efs" -> null
            # (1 unchanged attribute hidden)

          - efs_volume_configuration {
              - file_system_id          = "fs-0e0f22150227b252a" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 0 -> null

              - authorization_config {
                  - access_point_id = "fsap-076e0e4723ceab689" -> null
                  - iam             = "ENABLED" -> null
                }
            }
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "efs"
            # (1 unchanged attribute hidden)

          + efs_volume_configuration {
              + file_system_id          = "fs-0e0f22150227b252a"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 0

              + authorization_config {
                  + access_point_id = "fsap-076e0e4723ceab689"
                  + iam             = "ENABLED"
                }
            }
        }
    }

  # aws_iam_role_policy.step_functions_ecs_permissions will be updated in-place
~ resource "aws_iam_role_policy" "step_functions_ecs_permissions" {
        id          = "sharedservices_step_functions_role:step-functions-ecs-permissions"
        name        = "step-functions-ecs-permissions"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecs:RunTask",
                          - "ecs:DescribeTasks",
                          - "ecs:DescribeTaskDefinition",
                          - "iam:PassRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecs:us-east-2:825765422855:task-definition/weekly_news_recap:5",
                          - "arn:aws:ecs:us-east-2:825765422855:cluster/sharedservices-render-cluster",
                        ]
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::825765422855:role/sharedservices_ecs_exec_role",
                          - "arn:aws:iam::825765422855:role/sharedservices_ecs_task_role",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy.step_functions_policy_recap will be updated in-place
~ resource "aws_iam_role_policy" "step_functions_policy_recap" {
        id          = "sharedservices_step_functions_role:sharedservices_step_functions_policy"
        name        = "sharedservices_step_functions_policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:us-east-2:825765422855:function:get_logo",
                          - "arn:aws:lambda:us-east-2:825765422855:function:delete_logo",
                          - "arn:aws:lambda:us-east-2:825765422855:function:notify_post",
                        ]
                    },
                  - {
                      - Action   = [
                          - "logs:CreateLogDelivery",
                          - "logs:GetLogDelivery",
                          - "logs:UpdateLogDelivery",
                          - "logs:DeleteLogDelivery",
                          - "logs:ListLogDeliveries",
                          - "logs:PutResourcePolicy",
                          - "logs:DescribeResourcePolicies",
                          - "logs:DescribeLogGroups",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "events:PutRule",
                          - "events:PutTargets",
                          - "events:DescribeRule",
                          - "events:RemoveTargets",
                          - "events:DeleteRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:*:*:rule/StepFunctionsGetEventsForECSTaskRule*"
                    },
                  - {
                      - Action   = [
                          - "ecs:RunTask",
                          - "ecs:StopTask",
                          - "ecs:DescribeTasks",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecs:us-east-2:825765422855:task-definition/render_video:5"
                    },
                  - {
                      - Action    = "iam:PassRole"
                      - Condition = {
                          - StringEquals = {
                              - "iam:PassedToService" = "ecs-tasks.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = [
                          - "arn:aws:iam::825765422855:role/sharedservices_ecs_exec_role",
                          - "arn:aws:iam::825765422855:role/sharedservices_ecs_task_role",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_sfn_state_machine.weekly_recap will be updated in-place
~ resource "aws_sfn_state_machine" "weekly_recap" {
      ~ definition                = jsonencode(
            {
              - Comment = "Generate recap images for every account and notify Teams"
              - StartAt = "RunWeeklyRecap"
              - States  = {
                  - RunWeeklyRecap = {
                      - End        = true
                      - Parameters = {
                          - Cluster              = "arn:aws:ecs:us-east-2:825765422855:cluster/sharedservices-render-cluster"
                          - LaunchType           = "FARGATE"
                          - NetworkConfiguration = {
                              - AwsvpcConfiguration = {
                                  - AssignPublicIp = "ENABLED"
                                  - SecurityGroups = [
                                      - "sg-00b24671fa06607c7",
                                    ]
                                  - Subnets        = [
                                      - "subnet-0bbe8a2b2335e4038",
                                      - "subnet-0b4e467b5cedc1cd3",
                                    ]
                                }
                            }
                          - Overrides            = {
                              - ContainerOverrides = [
                                  - {
                                      - Environment = [
                                          - {
                                              - Name      = "EVENT_JSON"
                                              - "Value.$" = "States.JsonToString($)"
                                            },
                                        ]
                                      - Name        = "weekly_recap"
                                    },
                                ]
                            }
                          - TaskDefinition       = "arn:aws:ecs:us-east-2:825765422855:task-definition/weekly_news_recap:5"
                        }
                      - Resource   = "arn:aws:states:::ecs:runTask.sync"
                      - Type       = "Task"
                    }
                }
            }
        ) -> (known after apply)
        id                        = "arn:aws:states:us-east-2:825765422855:stateMachine:weekly_news_recap"
        name                      = "weekly_news_recap"
        tags                      = {}
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 6 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fsharedservices-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 1 to add, 6 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```